import { useState , useContext , useEffect } from "react"
import StaticNav from '../components/StaticNav'
import Background from '../components/Background'
import Block from '../components/Block'
import BackToTop from '../components/BackToTop'

import { H4 } from '../components/standard/H'
import P from '../components/standard/P'

import { LanguageContext } from '../contexts/Language'
import { NoEncryption } from "@material-ui/icons"

interface paramsInterface {
    lang?: string;
}

const th = ["ข้อกำหนดและเงื่อนไขการใช้งาน","0.คำนิยาม","- Katrade (“ไซด์” , “เว็บแอพ”)","- สร้างแอคเคาท์(“บัญชี”)","- ผู้พัฒนา(“เรา”, “พวกเรา” หรือ “ของเรา”)","- “บริการ”","- แลกเปลี่ยนสิ่งของ(“เทรด”) เพื่อการแลกเปลี่ยนสินค้าระหว่างคู่เทรด (คนสองคนที่ตกลงแลกเปลี่ยนสิ่งของกัน) (เรียกรวมว่า “ผู้เทรด” , “คู่เทรด” และ “ผู้ใช้” )",
    "1. บทนำ","1.1 ขอต้อนรับสู่ Katrade (“ไซด์” , “เว็บแอพ”) โปรดอ่านเงื่อนไขการให้บริการต่อไปนี้อย่างละเอียดก่อนใช้เว็บแอพนี้หรือสร้างแอคเคาท์(“บัญชี”) เพื่อที่คุณจะได้ทราบถึงสิทธิและข้อผูกพันตามกฎหมายของคุณอันเกี่ยวเนื่องกับ ผู้พัฒนา(“เรา”, “พวกเรา” หรือ “ของเรา”) “บริการ” ที่เราจัดมอบให้ผ่านทางเว็บแอพ รวมทั้งคุณสมบัติใหม่ใดๆ ที่เพิ่มไปหรือเสริมให้กับบริการจะอยู่ภายใต้เงื่อนไขการให้บริการนี้ด้วยเช่นกัน เงื่อนไขการให้บริการนี้จะควบคุมการใช้บริการของคุณซึ่งจัดไว้ให้โดย ผู้พัฒนา",
    "1.2 บริการที่รวมบริการแพลตฟอร์มออนไลน์ซึ่งไว้ใช้แลกเปลี่ยนสิ่งของ(“เทรด”) เพื่อการแลกเปลี่ยนสินค้าระหว่างคู่เทรด (คนสองคนที่ตกลงแลกเปลี่ยนสิ่งของกัน) (เรียกรวมว่า “ผู้เทรด” , “คู่เทรด” และ “ผู้ใช้” ) สัญญาแลกเปลี่ยนที่แท้จริงเป็นสัญญาระหว่างผู้เทรดและคู๋เทรดโดยตรง และ Katrade ไม่ได้เป็นคู่สัญญาของสัญญาฉบับนั้นหรือสัญญาอื่นใดระหว่างผู้เทรดและคู่เทรด และจะไม่ยอมรับข้อผูกพันใดๆ ที่เกี่ยวเนื่องกับสัญญาดังกล่าว คู่สัญญาของธุรกรรมดังกล่าวจะรับผิดชอบต่อสัญญาระหว่างคู่สัญญาทั้งหมด บัญชีรายชื่อสินค้า การรับประกันการแลกเปลี่ยนและสิ่งอื่นที่คล้ายกัน Katrade ไม่มีส่วนเกี่ยวข้องในธุรกรรมระหว่างผู้ใช้ Katrade ไม่ทำการคัดกรองล่วงหน้าต่อผู้ใช้ หรือเนื้อหาหรือข้อมูลที่จัดไว้ให้โดยผู้ใช้ Katrade ไม่สามารถรับประกันว่าผู้ใช้จะทำธุรกรรมเสร็จสิ้นจริงๆ",
    "1.3 ก่อนที่จะเป็นสมาชิกของ Katrade คุณจะต้องอ่านและยอมรับข้อกำหนด นโยบาย และเงื่อนไขทั้งหมดใน และที่เชื่อมโยงกับ เงื่อนไขการให้บริการนี้และคุณจะต้องยินยอมรับการดำเนินการข้อมูลส่วนบุคคลของคุณดังที่อธิบายไว้ในนโยบายความเป็นส่วนตัวซึ่งมีลิงก์ไว้ในที่นี้",
    "1.4 Katrade สงวนสิทธิ์ในการเปลี่ยนแปลง ดัดแปลง ระงับ หรือยกเลิกไซต์นี้หรือบริการทั้งหมดหรือบางส่วนได้ตลอดเวลา Katrade อาจออกบริการบางอย่างหรือคุณสมบัติของบริการในรุ่นเบต้า ซึ่งอาจไม่ทำงานอย่างถูกต้อง หรือในลักษณะเดียวกันกับที่รุ่นสุดท้ายอาจทำงาน และเราจะไม่รับผิดในสถานการณ์ดังกล่าว Katrade ยังอาจกำหนดขอบเขตสำหรับคุณสมบัติบางอย่าง หรือจำกัดการเข้าถึงบางส่วนหรือทั้งหมดของไซต์หรือบริการโดยใช้ดุลยพินิจของตัวเองแต่เพียงผู้เดียว และโดยไม่ต้องแจ้งหรือรับผิด",
    "1.5 Katrade สงวนสิทธิ์ในการปฏิเสธที่จะให้คุณเข้าถึงไซต์หรือบริการ หรือปฏิเสธที่จะอนุญาตให้คุณเปิดบัญชีไม่ว่าด้วยเหตุผลใดก็ตาม",
    "โดยการใช้บริการหรือเปิดบัญชี Katrade คุณได้ให้การยอมรับและความยินยอมที่เพิกถอนไม่ได้ต่อข้อตกลงนี้ รวมถึงข้อกำหนด เงื่อนไขและนโยบายเพิ่มเติมที่อ้างถึงในที่นี่และ/หรือมีลิงก์ไว้ในที่นี้",
    "หากคุณไม่เห็นด้วยกับข้อตกลงนี้ โปรดงดใช้บริการหรือเข้าถึงไซต์ของเรา หากคุณอายุต่ำกว่า 18 ปีหรือยังไม่บรรลุนิติภาวะที่จะให้คำยินยอมต่อข้อกำหนดนี้ตามกฎหมายที่เกี่ยวข้องในประเทศของคุณ (“นิติภาวะ”) คุณจะต้องขออนุญาตจากพ่อแม่หรือผู้ปกครองตามกฎหมายเพื่อเปิดบัญชี และพ่อแม่หรือผู้ปกครองตามกฎหมายดังกล่าวต้องเห็นด้วยกับข้อกำหนดของข้อตกลงนี้ หากคุณไม่ทราบว่าคุณบรรลุนิติภาวะแล้วหรือยัง หรือไม่เข้าใจความในข้อนี้ โปรดอย่าสร้างบัญชีจนกว่าจะได้ขอความช่วยเหลือจากพ่อแม่หรือผู้ปกครองตามกฎหมายแล้ว หากคุณคือพ่อแม่หรือผู้ปกครองตามกฎหมายของผู้เยาว์ที่กำลังสร้างบัญชี คุณจะต้องยอมรับข้อกำหนดของข้อตกลงนี้แทนผู้เยาว์และคุณจะต้องรับผิดชอบต่อการใช้งานบัญชีหรือบริการของบริษัททั้งหมดจากการใช้บัญชีดังกล่าว ไม่ว่าบัญชีดังกล่าวจะเปิดอยู่แล้วในขณะนี้หรือสร้างในภายหลังก็ตาม",
    "2. ความเป็นส่วนตัว","2.1 Katrade ให้ความสำคัญอย่างมากกับความเป็นส่วนตัวของคุณ และเพื่อสามารถคุ้มครองสิทธิของคุณได้ดีขึ้น เราจึงจัดทำนโยบายความเป็นส่วนตัวของ Katrade เพื่ออธิบายรายละเอียดในแนวทางปฏิบัติด้านความเป็นส่วนตัว โปรดอ่านนโยบายความเป็นส่วนตัวนี้เพื่อให้เข้าใจว่า Katrade เก็บรวบรวมและใช้ข้อมูลที่เกี่ยวกับบัญชีของคุณและ/หรือการใช้งานบริการของคุณอย่างไร โดยการใช้บริการหรือให้ข้อมูลทางไซต์ คุณ:",
    "(ก) ยินยอมให้ Katrade เก็บรวบรวม ใช้งาน เปิดเผย และ/หรือดำเนินการกับเนื้อหา ข้อมูลส่วนบุคคลของคุณและข้อมูลของผู้ใช้ตามที่อธิบายไว้ในนโยบายความเป็นส่วนตัว",
    "(ข) ตกลงและยอมรับว่าสิทธิการเป็นเจ้าของในข้อมูลของผู้ใช้เป็นของ Katrade และของคุณร่วมกัน",
    "(ค) จะไม่เปิดเผยข้อมูลของผู้ใช้ต่อบุคคลภายนอก ไม่ว่าทั้งหมดหรือบางส่วน หรือยินยอมให้บุคคลภายนอกสามารถเข้าถึงหรือใช้ข้อมูลของผู้ใช้ของท่านโดยไม่ได้รับความยินยอมจาก Katrade เป็นลายลักษณ์อักษรก่อน",
    "2.2 ผู้ใช้ที่ครอบครองข้อมูลส่วนบุคคลของผู้ใช้คนอื่นผ่านการใช้บริการ ต้องตกลงว่าจะ:",
    "(ก) ปฏิบัติตามกฎหมายคุ้มครองข้อมูลส่วนบุคคลที่บังคับใช้ทั้งหมดอันเกี่ยวกับข้อมูลดังกล่าว",
    "(ข) อนุญาตให้ผู้ใช้ ซึ่งถูกเก็บรวบรวมข้อมูลส่วนบุคคลไว้โดยผู้ใช้อีกคน ลบข้อมูลของตนออกจากฐานข้อมูลของผู้ใช้คนนั้นๆได้",
    "(ค) อนุญาตให้ผู้ใช้ที่ถูกเก็บข้อมูลตรวจสอบว่าผู้ใช้ที่เก็บข้อมูลมีการเก็บรวบรวมข้อมูลใดบ้างเกี่ยวกับตน ในแต่ละกรณีของข้อ (ข) และข้อ (ค) ข้างต้น ตามและเมื่อกฎหมายที่บังคับใช้กำหนดไว้",
    "3. สิทธิ์การใช้งานแบบจำกัด","3.1 Katrade มอบสิทธิ์การใช้งานแบบจำกัดและเพิกถอนได้ในการเข้าถึงและใช้บริการตามข้อกำหนด และเงื่อนไขของเงื่อนไขการให้บริการนี้ เนื้อหา เครื่องหมายการค้า เครื่องหมายบริการ ชื่อตราสินค้า โลโก้ และทรัพย์สินทางปัญญาอื่นๆ ที่มีกรรมสิทธิ์ทั้งหมด (“ทรัพย์สินทางปัญญา”) ที่แสดงในไซต์ เป็นทรัพย์สินของ Katrade และหากเหมาะสม เป็นทรัพย์สินของบุคคลภายนอกที่ถือกรรมสิทธิ์ตามที่ระบุไว้ในไซต์ ไม่มีการมอบสิทธิหรือสิทธิ์การใช้งานทั้งโดยตรงหรือโดยอ้อมแก่บุคคลใดที่เข้าถึงไซต์เพื่อใช้งานหรือลอกเลียนแบบทรัพย์สินทางปัญญาใด และไม่มีบุคคลใดที่เข้าถึงไซต์จะสามารถอ้างสิทธิ กรรมสิทธิ์ หรือผลประโยชน์ในไซต์นี้ได้ โดยการใช้หรือเข้าถึงบริการ คุณตกลงที่จะปฏิบัติตามกฎหมายลิขสิทธิ์ เครื่องหมายการค้า เครื่องหมายบริการ และกฎหมายที่บังคับใช้อื่นๆ ทั้งหมด ที่คุ้มครองบริการ ไซต์ และเนื้อหาในไซต์ คุณตกลงที่จะไม่คัดลอก แจกจ่าย เผยแพร่ต่อ ส่งต่อ แสดงแก่สาธารณะ ดำเนินการต่อสาธารณะ ดัดแปลง ปรับเปลี่ยน ให้เช่า ขาย หรือสร้างงานอนุพันธ์จากส่วนหนึ่งส่วนใดของบริการ ไซต์ หรือเนื้อหาในไซต์ คุณยังจะต้องไม่สะท้อนหรือตีกรอบส่วนหนึ่งส่วนใดหรือทั้งหมดของเนื้อหาในไซต์นี้บนเซิร์ฟเวอร์อื่นใด หรือเป็นส่วนหนึ่งของเว็บไซต์อื่น โดยไม่ได้รับคำยินยอมเป็นลายลักษณ์อักษรล่วงหน้าจากเรา นอกจากนี้ คุณตกลงว่าจะไม่ใช้โรบอต สไปเดอร์ หรืออุปกรณ์อัตโนมัติอื่นใด หรือกระบวนการที่ทำด้วยมือเพื่อเฝ้าติดตามหรือคัดลอกเนื้อหาของเรา โดยไม่ได้รับคำยินยอมเป็นลายลักษณ์อักษรล่วงหน้าจากเรา (คำยินยอมดังกล่าวจะถือว่ามอบให้สำหรับเทคโนโลยีเครื่องมือค้นหามาตรฐานที่ใช้โดยเว็บไซต์ค้นหาทางอินเทอร์เน็ตเพื่อนำผู้ใช้อินเทอร์เน็ตมายังเว็บไซต์นี้)",
    "3.2 คุณสามารถเชื่อมโยงไปยังไซต์จากเว็บไซต์ของคุณ โดยมีข้อแม้ว่าเว็บไซต์ของคุณไม่ได้แสดงนัยของการรับรองโดยหรือเชื่อมโยงกับ Katrade คุณรับทราบว่า Katrade อาจยกเลิกการให้บริการไม่ว่าทั้งหมดหรือบางส่วนได้ตลอดเวลา ตามดุลยพินิจแต่เพียงผู้เดียวของตน โดยไม่ต้องแจ้งให้ทราบ",
    "4. ซอฟต์แวร์","ซอฟต์แวร์ที่เราจัดไว้ให้คุณเป็นส่วนหนึ่งของบริการนี้ อยู่ภายใต้ข้อกำหนดของเงื่อนไขการให้บริการนี้ Katrade สงวนสิทธิ์ทั้งหมดต่อซอฟต์แวร์ที่ไม่ได้อนุญาตไว้อย่างชัดแจ้งโดย Katrade ในที่นี้ สคริปต์หรือรหัสของบุคคลภายนอก ที่เชื่อมโยงไปยังหรืออ้างถึงจากบริการ บุคคลภายนอกที่เป็นเจ้าของสคริปต์หรือรหัสดังกล่าวเป็นผู้มอบสิทธิ์การใช้งานให้แก่คุณ ไม่ใช่มอบให้โดย Katrade",
    "5. บัญชีและความปลอดภัย",'5.1 การทำงานบางอย่างของบริการของเราต้องมีการลงทะเบียนบัญชีโดยเลือกรหัสประจำตัวผู้ใช้ที่ไม่ซ้ำกัน ("ID ผู้ใช้") และรหัสผ่าน และโดยการให้ข้อมูลส่วนบุคคลบางอย่าง หากคุณเลือก ID ผู้ใช้ ที่ตามดุลยพินิจแต่เพียงผู้เดียวของ Katradeเห็นว่า สร้างความขุ่นเคืองหรือไม่เหมาะสม Katradeมีสิทธิที่จะระงับหรือยกเลิกบัญชีของคุณได้ คุณอาจสามารถใช้บัญชีเพื่อเข้าถึงผลิตภัณฑ์ เว็บไซต์ หรือบริการอื่นๆ ซึ่งเราอนุญาตให้เข้าถึงได้ หรือที่เชื่อมโยงกันหรือทำงานร่วมกัน Katrade ไม่ได้ตรวจสอบ และไม่รับผิดชอบต่อเนื้อหาของบุคคลภายนอก ฟังก์ชั่นการทำงาน ความปลอดภัย บริการ นโยบายความเป็นส่วนตัว หรือการปฏิบัติอื่นๆ ของผลิตภัณฑ์ เว็บไซต์ หรือบริการเหล่านั้น หากคุณกระทำการดังกล่าว เงื่อนไขการให้บริการของผลิตภัณฑ์ เว็บไซต์ หรือบริการเหล่านั้น รวมถึงนโยบายความเป็นส่วนตัวที่เกี่ยวข้อง หากแตกต่างจากเงื่อนไขการให้บริการและ/หรือนโยบายความเป็นส่วนตัวของเรา อาจบังคับใช้กับการใช้ผลิตภัณฑ์ เว็บไซต์ หรือบริการเหล่านั้นของคุณ',
    "5.2 คุณตกลงที่จะ :","(ก) เก็บรักษารหัสผ่านไว้เป็นความลับและใช้เฉพาะ ID ผู้ใช้และรหัสผ่านของคุณเมื่อเข้าสู่ระบบ",
    "(ข) ตรวจสอบให้แน่ใจว่าคุณออกจากระบบบัญชีเมื่อสิ้นสุดแต่ละเซสชันบนไซต์",
    "(ค) แจ้ง Katrade ทันทีหากมีการใช้บัญชี ID ผู้ใช้ และ/หรือรหัสผ่านของคุณโดยไม่ได้รับอนุญาต",
    "(ง) ตรวจสอบให้แน่ใจว่าข้อมูลบัญชีของคุณถูกต้องและเป็นปัจจุบันอยู่เสมอ คุณต้องรับผิดชอบอย่างเต็มที่ต่อกิจกรรมทั้งหมดที่เกิดขึ้นภายใต้ ID ผู้ใช้และบัญชีของคุณ แม้ว่าคุณจะไม่ได้ทำกิจกรรมหรือทำการใช้งานดังกล่าวก็ตาม Katradeจะไม่รับผิดต่อความสูญเสียหรือความเสียหายที่เกิดจากการใช้รหัสผ่านของคุณโดยไม่ได้อนุญาต หรือการที่คุณไม่สามารถปฏิบัติตามความในส่วนนี้",
    "5.3 คุณตกลงว่า Katrade อาจ ไม่ว่าด้วยเหตุผลใดและตามดุลยพินิจแต่เพียงผู้เดียวของตน และโดยไม่ต้องแจ้งหรือรับผิดต่อคุณหรือบุคคลภายนอกใดๆ ยกเลิกบัญชีและ ID ผู้ใช้ของคุณทันที และลบหรือเพิกถอนเนื้อหาใดก็ตามที่เกี่ยวข้องกับบัญชีหรือ ID ผู้ใช้ของคุณออกจากไซต์ หรือในกรณีที่ร้ายแรงกว่านั้นอาจระงับการขายหรือการคืนเงินใดๆอย่างถาวรและ/หรือใช้มาตราการอื่นใดที่ Katrade เห็นสมควร มูลเหตุสำหรับการยกเลิกดังกล่าวอาจได้แก่ แต่ไม่จำกัดเพียง",
    "(ก) การไม่มีการใช้งานเป็นเวลานานๆ",
    "(ข) การละเมิดเจตนารมณ์หรือตัวอักษรของเงื่อนไขการให้บริการนี้",
    "(ค) พฤติกรรมผิดกฎหมาย ฉ้อฉล ล่วงละเมิด ทำให้เสื่อมเสีย คุกคาม หรือขู่เข็ญ",
    "(ง) การมีบัญชีผู้ใช้หลายบัญชี",
    "(จ) การซื้อสินค้าจากไซต์โดยมีวัตถุประสงค์เพื่อการจำหน่ายต่อ",
    "(ฉ) การซื้อสินค้าจากผู้ขายรายเดียวหรือกลุ่มผู้ขายเดียวกันในลักษณะที่ผิดปกติวิสัยหรือในปริมาณที่มากเกินปกติ",
    "(ช) พฤติกรรมที่เป็นอันตรายต่อผู้ใช้คนอื่น บุคคลภายนอก หรือผลประโยชน์ทางธุรกิจของ Katrade การใช้บัญชีเพื่อจุดประสงค์ที่ผิดกฎหมาย ฉ้อฉล ล่วงละเมิด ทำให้เสื่อมเสีย คุกคาม หรือขู่เข็ญ อาจมีการแจ้งให้หน่วยงานบังคับใช้กฎหมายทราบโดยไม่ต้องแจ้งแก่คุณ หากเกิดข้อพิพาททางกฎหมายหรือการดำเนินคดีเกี่ยวกับบัญชีหรือการใช้บริการของคุณ ไม่ว่าด้วยเหตุผลใดก็ตาม Katrade อาจยกเลิกบัญชีของคุณทันทีโดยไม่แจ้งให้ทราบ",
    "5.4 ผู้ใช้สามารถยกเลิกบัญชีของตนได้หากแจ้งให้ Katrade ทราบเป็นลายลักษณ์อักษร (รวมทั้งทางอีเมลที่ katrade.ku@gmail.com ว่าประสงค์ที่จะดำเนินการดังกล่าว โดยไม่คำนึงถึงการยกเลิกดังกล่าว ผู้ใช้ยังคงต้องรับผิดชอบและรับผิดต่อธุรกรรมใดก็ตามที่ยังทำไม่เสร็จสิ้น (ไม่ว่าจะเริ่มก่อนหรือหลังการยกเลิกดังกล่าว) การจัดส่งผลิตภัณฑ์ การชำระค่าผลิตภัณฑ์ หรืออย่างอื่นที่คล้ายกัน และผู้ใช้จะต้องติดต่อ Katrade หลังจากได้ดำเนินการและทำธุรกรรมที่ยังไม่เสร็จสิ้นทั้งหมดให้เสร็จสิ้นในทันทีและอย่างมีประสิทธิภาพตามเงื่อนไขการให้บริการนี้ Katrade ไม่ต้องรับผิด และจะไม่รับผิดต่อความเสียหายที่เกิดขึ้นอันเนื่องมาจากการดำเนินการตามส่วนนี้ ผู้ใช้จะสละสิทธิ์ในการเรียกร้องใดๆ และทั้งหมดบนพื้นฐานการดำเนินการดังกล่าวโดย Katrade",
    "5.5 คุณสามารถใช้บริการและ/หรือเปิดบัญชีได้ต่อเมื่อคุณอาศัยอยู่ในประเทศที่ได้รับอนุญาตจากเรา ซึ่งจะมีการปรับปรุงเป็นครั้งคราว",
    "6. เงื่อนไขการใช้งาน",
    "6.1 สิทธิ์การใช้งานไซต์นี้และบริการมีผลจนกว่าจะมีการยกเลิก สิทธิ์การใช้งานนี้จะยกเลิกตามที่ระบุไว้ในเงื่อนไขการให้บริการ หรือเมื่อคุณไม่ปฏิบัติตามข้อกำหนดหรือเงื่อนไขใดๆ ของเงื่อนไขการให้บริการนี้ ในกรณีดังกล่าว ไม่จำเป็นต้องแจ้งแก่ Katrade เพื่อให้การยกเลิกดังกล่าวมีผล",
    "6.2 คุณตกลงที่จะไม่ :",
    "(ก) อัปโหลด โพสต์ ส่งต่อ หรือแสดงเนื้อหาในลักษณะที่ผิดกฎหมาย เป็นภัย คุกคาม ขู่เข็ญ ล่วงละเมิด ทำให้ตื่นตกใจ ทำให้เป็นทุกข์ หลอกลวง ทำให้เสื่อมเสีย หยาบคาย ลามก หมิ่นประมาท ละเอียดอ่อนทางการเมือง ล่วงล้ำความเป็นส่วนตัวของผู้อื่น น่ารังเกียจ เหยียดเชื้อชาติหรือชาติพันธุ์ ",
    "(ข) ละเมิดกฎหมายซึ่งรวมถึงแต่ไม่จำกัดเฉพาะกฎหมายและข้อบังคับที่เกี่ยวกับข้อจำกัดการส่งออกและการนำเข้า สิทธิของบุคคลภายนอก หรือนโยบายสิ่งของต้องห้ามและสิ่งของที่ถูกจำกัด ของเรา",
    "(ค) อัปโหลด โพสต์ ส่งต่อหรือกระทำเนื้อหาใดๆ ที่ส่วนเกี่ยวข้องกับการใช้ผู้เยาว์ที่ไม่ได้อยู่ภายใต้การดูแลของผู้ปกครอง หรือ ใช้บริการเพื่อทำอันตรายต่อผู้เยาว์ไม่ว่าในทางใดก็ตาม",
    "(ง) ใช้บริการหรืออัปโหลดเนื้อหาเพื่อปลอมแปลงเป็นบุคคลหรือนิติบุคคลอื่น หรือแสดงข้อมูลเท็จเกี่ยวกับความเชื่อมโยงกับบุคคลหรือนิติบุคคลใด",
    "(จ) ปลอมแปลงส่วนหัวหรือปรับเปลี่ยนรหัสประจำตัวเพื่อปิดบังแหล่งกำหนดของเนื้อหาที่ส่งต่อผ่านบริการ",
    "(ฉ) ลบประกาศเกี่ยวกับกรรมสิทธิ์ออกจากไซต์",
    "(ช) เป็นต้นเหตุ อนุญาตหรือมอบอำนาจให้ทำการดัดแปลง สร้างงานอนุพันธ์ หรือแปลบริการโดยไม่ได้รับอนุญาตอย่างชัดแจ้งจาก Katrade",
    "(ซ) ใช้บริการเพื่อประโยชน์ของบุคคลภายนอกหรือในลักษณะที่ไม่ได้รับอนุญาตตามสิทธิ์การใช้งานที่ให้ไว้ในที่นี้",
    "(ฌ) ใช้บริการหรืออัปโหลดเนื้อหาในลักษณะที่ไม่เหมาะสม เป็นการฉ้อฉล ผิดจรรยาบรรณ ไม่เป็นความจริง ชี้นำไปในทางที่ผิดหรือเป็นการหลอกลวง",
    "(ญ) เปิดใช้หรือมีบัญชีผู้ใช้หลายบัญชีเพื่อกระทำการใดๆ ที่เป็นการละเมิดข้อกำหนดหรือวัตถุประสงค์ของข้อกำหนดเงื่อนไขการให้บริการนี้",
    "(ฎ) เข้าถึงแพลตฟอร์มของ Katrade เปิดบัญชีผู้ใช้หรือเข้าถึงบัญชีผู้ใช้ของคุณโดยใช้ ฮาร์ดแวร์ ชุดคำสั่ง หรือโปรแกรมที่ไม่เป็นทางการของ Katrade ซึ่งไม่จำกัดเฉพาะ โปรแกรมเลียนแบบ (emulator) โปรแกรมจำลอง (simulator) บอท (bot) หรือซอฟแวร์หรือฮาร์ดแวร์อื่นใด",
    "(ฏ) พยายามแยกส่วนแฟ้ม ทำวิศวกรรมย้อนกลับ ถอดประกอบหรือเจาะระบบบริการ (หรือส่วนหนึ่งส่วนใดของบริการ) หรือเอาชนะหรือทำลายเทคโนโลยีการเข้ารหัสหรือมาตรการความปลอดภัยที่ Katrade นำมาใช้กับบริการและ / หรือข้อมูลที่ส่งต่อ ดำเนินการ หรือจัดเก็บไว้โดย Katrade",
    "(ฐ) เก็บเกี่ยวหรือเก็บรวบรวมข้อมูลเกี่ยวกับเจ้าของบัญชีคนอื่น รวมถึง โดยไม่จำกัดเพียงข้อมูลส่วนบุคคลใดๆ",
    "(ฑ) อัปโหลด อีเมล โพสต์ ส่งต่อ หรือทำให้เนื้อหาที่คุณไม่มีสิทธิ์ทำให้ใช้งานได้ภายใต้กฎหมายหรือภายใต้ความสัมพันธ์ตามสัญญาหรือการมอบอำนาจ (เช่น ข้อมูลภายใน ข้อมูลที่เป็นกรรมสิทธิ์และข้อมูลลับที่ได้ทราบหรือถูกเปิดเผยจากความสัมพันธ์ในการจ้างงานหรือภายใต้ข้อตกลงไม่เปิดเผยข้อมูล) ใช้งานได้",
    "(ฒ) อัปโหลด อีเมล โพสต์ ส่งต่อ หรือทำให้เนื้อหาที่ละเมิดสิทธิบัตร เครื่องหมายการค้า ความลับทางการค้า ลิขสิทธิ์ หรือกรรมสิทธิ์อื่นๆ ของบุคคลอื่น ใช้งานได้",
    "(ณ) อัปโหลด อีเมล โพสต์ ส่งต่อ หรือทำให้โฆษณาที่ไม่ได้ร้องขอหรือได้รับอนุญาต สื่อประชาสัมพันธ์ “เมลขยะ” “สแปม” “จดหมายลูกโซ่” “ธุรกิจแบบพีระมิด” หรือรูปแบบการเชิญชวนอื่นใดที่ไม่ได้รับอนุญาต ใช้งานได้",
    "(ด) อัปโหลด อีเมล โพสต์ ส่งต่อ หรือทำให้วัสดุอื่นๆ ที่มีไวรัสซอฟต์แวร์ หนอน ม้าโทรจัน หรือรหัสคอมพิวเตอร์ รูทีน ไฟล์หรือโปรแกรมที่ออกแบบมาเพื่อแทรกแซงทั้งโดยตรงและโดยอ้อมต่อ ปรับเปลี่ยน ขัดขวาง ทำลาย หรือจำกัดฟังก์ชั่นการทำงานของซอฟต์แวร์คอมพิวเตอร์หรือฮาร์ดแวร์ใดๆ หรือข้อมูลหรืออุปกรณ์โทรคมนาคม ใช้งานได้",
    "(ต) ทำให้กระบวนการไหลปกติของบทสนทนาหยุดชะงัก ทำให้หน้าจอ “เลื่อน” เร็วกว่าที่ผู้ใช้บริการคนอื่นๆ จะสามารถพิมพ์ได้ หรือกระทำการในลักษณะที่ส่งผลเชิงลบต่อความสามารถของผู้ใช้คนอื่นในการเข้าร่วมการแลกเปลี่ยนตามเวลาจริง",
    "(ถ) แทรกแซง ปรับเปลี่ยน หรือขัดขวางบริการหรือเซิร์ฟเวอร์หรือเครือข่ายที่เชื่อมต่อกับบริการหรือการใช้งานของผู้ใช้คนอื่นและการเพลิดเพลินกับบริการ หรือฝ่าฝืนข้อกำหนด กระบวนการ นโยบาย หรือข้อบังคับของเครือข่ายที่เชื่อมต่อกับไซต์",
    "(ท) ดำเนินการหรือเข้าร่วมในการกระทำที่อาจส่งผลเสียหายทั้งทางตรงหรือทางอ้อม ปิดใช้งาน สร้างภาระหนัก หรือทำให้บริการหรือเซิร์ฟเวอร์หรือเครือข่ายที่เชื่อมต่อกับบริการมีข้อบกพร่อง",
    "(ธ) ใช้บริการเพื่อเจตนาหรือไม่เจตนาฝ่าฝืนกฎหมาย กฎระเบียบ ประมวลกฎหมาย คำสั่ง แนวทางปฏิบัติ นโยบาย หรือข้อบังคับของท้องถิ่น ของรัฐ ประเทศ หรือระหว่างประเทศที่เกี่ยวข้อง รวมถึง แต่ไม่จำกัดเพียง กฎหมายและข้อกำหนด (ไม่ว่ามีอำนาจทางกฎหมายของไม่) เกี่ยวกับการป้องกันการฟอกเงินหรือการต่อต้านการก่อการร้าย",
    "(น) ใช้บริการเพื่อฝ่าฝืนหรือหลบเลี่ยง การคว่ำบาตรหรือการห้ามค้าขายที่ดำเนินการหรือบังคับใช้โดยสำนักควบคุมสินทรัพย์ต่างประเทศของกระทรวงการคลังสหรัฐฯ คณะมนตรีความมั่นคงแห่งสหประชาชาติ กระทรวงการคลังสหภาพยุโรปหรือสหราชอาณาจักร",
    "(บ) ใช้บริการเพื่อฝ่าฝืนความเป็นส่วนตัวของผู้อื่น หรือ “ติดตาม” หรือก่อกวนผู้อื่น",
    "(ป) ละเมิดสิทธิต่างๆ ของ Katrade ซึ่งรวมถึงสิทธิในทรัพย์สินทางปัญญาและการลวงขายในเรื่องนั้นๆ ด้วย",
    "(ผ) ใช้บริการเพื่อเก็บรวบรวมหรือจัดเก็บข้อมูลส่วนบุคคลเกี่ยวกับผู้ใช้คนอื่นที่เกี่ยวกับการกระทำและกิจกรรมต้องห้ามที่ระบุไว้ด้านบน",
    "(ฝ) ลงรายการที่ละเมิดลิขสิทธิ์ เครื่องหมายการค้า หรือสิทธิในทรัพย์สินทางปัญหาของบุคคลภายนอกหรือ ใช้บริการในลักษณะที่จะละเมิดสิทธิ์ในทรัพย์สินทางปัญญาของผู้อื่น และ/หรือ ‘สั่ง หรือ สนับสนุนให้ผู้ใช้ทำธุรกรรมนอกไซต์",
    "6.3 คุณเข้าใจว่าเนื้อหาทั้งหมด ไม่ว่าโพสต์ต่อสาธารณะหรือส่งต่อแบบเป็นส่วนตัว เป็นความรับผิดชอบของผู้ที่เป็นต้นกำเนิดของเนื้อหาดังกล่าวแต่เพียงผู้เดียว นั่นหมายความว่า คุณ (ไม่ใช่ Katrade ) ที่ต้องรับผิดชอบต่อเนื้อหาทั้งหมดที่คุณอัปโหลด โพสต์ อีเมล ส่งต่อ หรือทำให้ใช้งานได้ทางไซต์แต่เพียงผู้เดียว Katrade ไม่ควบคุมเนื้อหาที่โพสต์บนไซต์ และดังนั้น จึงไม่รับประกันความถูกต้อง ความสมบูรณ์ หรือคุณภาพของเนื้อหาดังกล่าว คุณเข้าใจว่าในการใช้ไซต์ คุณอาจพบเจอกับเนื้อหาที่อาจถือได้ว่าสร้างความขุ่นเคืองใจ ลามกอนาจารหรือน่ารังเกียจ จนถึงขอบเขตสูงสุดที่กฎหมายที่เกี่ยวข้องอนุญาตไว้ ไม่ว่าในกรณีใดก็ตาม Katrade จะไม่รับผิดไม่ว่าในทางใดต่อเนื้อหา รวมถึงแต่ไม่จำกัดเพียง ข้อผิดพลาด หรือการละเว้นเนื้อหา หรือการสูญเสียหรือความเสียหายชนิดใดก็ตามที่เกิดขึ้นอันเป็นผลมาจากการใช้ หรือการพึ่งพาเนื้อหาที่โพสต์ อีเมล ส่งต่อ หรือทำให้ใช้งานได้บนไซต์",
    "6.4 คุณรับทราบว่า Katrade อาจหรืออาจไม่คัดกรองเนื้อหาล่วงหน้า แต่ Katrade และผู้ที่ได้รับการแต่งตั้งจาก Katrade จะมีสิทธิ (แต่ไม่ใช่ข้อผูกพัน) ตามดุลยพินิจแต่เพียงผู้เดียวของตนในการคัดกรองล่วงหน้า ปฏิเสธ ลบหรือย้ายเนื้อหาใดๆ ที่ใช้งานได้บนไซต์ โดยไม่มีความรับผิดใดๆต่อคุณ โดยไม่เป็นการจำกัดสิ่งที่กล่าวไปก่อนหน้า Katrade และผู้ที่ได้รับการแต่งตั้งจาก Katrade มีสิทธิที่จะลบเนื้อหา",
    "(ก) ที่ละเมิดเงื่อนไขการให้บริการ หรือนโยบายสิ่งของต้องห้ามและสิ่งของที่ถูกจำกัดของ Katrade รวมทั้งข้อกำหนด เงื่อนไข และนโยบายใดๆ ของ Katrade",
    "(ข) ถ้าเราได้รับคำร้องเรียนจากผู้ใช้คนอื่น",
    "(ค) ถ้าเราได้รับแจ้งหรือได้รับการกล่าวหาเกี่ยวกับการละเมิดทรัพย์สินทางปัญญาหรือคำสั่งทางกฎหมายหรือคำร้องให้ลบออก หรือ",
    "(ง) ถ้าเนื้อหาดังกล่าวไม่เหมาะสมหรือน่ารังเกียจ เรายังอาจปิดกั้นการส่งการสื่อสาร (รวมถึงแต่ไม่จำกัดเพียง การอัปเดตสถานะ การโพสต์ ข้อความ และ/หรือการสนทนา) ไปยังหรือจากบริการ อันเป็นส่วนหนึ่งของความพยายามของเราที่จะปกป้องบริการหรือผู้ใช้ของเรา หรือบังคับใช้บทบัญญัติของข้อกำหนดและเงื่อนไขเหล่านี้ คุณตกลงว่าคุณจะต้องประเมิน และแบกรับความเสี่ยงทั้งหมดที่เกี่ยวกับการใช้เนื้อหา รวมถึงแต่ไม่จำกัดเพียง การพึ่งพาความถูกต้อง ความครบถ้วน หรือประโยชน์ของเนื้อหาดังกล่าว เกี่ยวกับเรื่องนี้ คุณรับทราบว่าคุณไม่ได้ และจนถึงขอบเขตสูงสุดที่กฎหมายที่เกี่ยวข้องอนุญาตไว้ ไม่สามารถพึ่งพาเนื้อหาที่ Katrade สร้างขึ้น หรือส่งมายัง Katrade รวมถึงแต่ไม่จำกัดเพียง ข้อมูลในกระดานสนทนาของ Katrade และในส่วนอื่นๆ ทั้งหมดของไซต์",
    "6.5 คุณรับทราบ ยินยอม และตกลงว่า Katrade อาจเข้าถึง รักษา และเปิดเผยข้อมูลบัญชีของคุณและเนื้อหาของคุณต่อหน่วยงานทางกฎหมายหรือผู้มีอำนาจภายในรัฐ เจ้าของสิทธิที่เกี่ยวข้องหรือบุคคลที่สามอื่นๆ หากกฎหมายกำหนดไว้เช่นนั้น หรือตามคำสั่งศาลหรือโดยหน่วยงานรัฐหรือหน่วยงานทางกฎหมายที่มีเขตอำนาจเหนือ Katrade หรือโดยการเชื่อโดยสุจริตว่าการเข้าถึงเพื่อรักษาหรือเปิดเผยนั้นมีความจำเป็นตามสมควรเพื่อ:",
    "(ก) ปฏิบัติตามขั้นตอนทางกฎหมาย",
    "(ข) บังคับใช้เงื่อนไขการให้บริการนี้หรือ นโยบายสิ่งของต้องห้ามและสิ่งของที่ถูกจำกัดของ Katrade รวมทั้งข้อกำหนด เงื่อนไข และนโยบายใดๆ ของ Katrade",
    "(ค) ตอบสนองต่อข้อเรียกร้องที่ว่าเนื้อหาใดละเมิดสิทธิของบุคคลภายนอกรวมถึงสิทธิในทรัพย์สินทางปัญญา",
    "(ง) ตอบสนองต่อคำขอการบริการลูกค้าของคุณ",
    "(จ) ปกป้องสิทธิ ทรัพย์สินหรือความปลอดภัยส่วนบุคคลของ Katrade ผู้ใช้และ/หรือประชาชนทั่วไป",
    "7. การละเมิดเงื่อนไขการให้บริการของเรา",
    "7.1 การละเมิดเงื่อนไขการให้บริการนี้ รวมถึงข้อกำหนด เงื่อนไข และนโยบายใดๆ ของ Katrade อาจส่งผลให้มีการดำเนินการหลายประการ รวมถึงแต่ไม่จำกัดเพียง สิ่งใดสิ่งหนึ่งหรือทั้งหมดต่อไปนี้",
    "o บัญชีรายชื่อถูกลบ",
    "o ถูกกำหนดขีดจำกัดสำหรับสิทธิพิเศษของบัญชี",
    "o บัญชีถูกระงับและยกเลิกในเวลาต่อมา",
    "o ถูกดำเนินคดีอาญา",
    "o ถูกดำเนินคดีทางแพ่ง รวมถึงแต่ไม่จำกัดเพียงการเรียกร้องค่าเสียหายและ/หรือวิธีการชั่วคราว ก่อนพิพากษาหรือคำสั่งห้ามของศาล",
    "7.2 หากคุณเชื่อว่าผู้ใช้บนไซต์ของเราละเมิดเงื่อนไขการให้บริการนี้ โปรดติดต่อ katrade.ku@gmail.com ",
    "8. การรายงานการละเมิดสิทธิ์ในทรัพย์สินทางปัญญา",
    "8.1 ตามที่ระบุไว้ข้างต้น Katrade ไม่อนุญาตให้มีการลงสินค้าที่ละเมิดสิทธิในทรัพย์สินทางปัญญาของแบรนด์หรือเจ้าของสิทธิในทรัพย์สินทางปัญญาอื่นๆ (“ เจ้าของIPR ”)",
    "8.2 ยกเว้นในกรณีที่ระบุไว้ชัดแจ้งเป็นอย่างอื่น ผู้ใช้เป็นปัจเจกบุคคลหรือธุรกิจที่เป็นอิสระและไม่เกี่ยวข้องกับ Katrade ไม่ว่าในทางใด Katrade มิใช่ตัวแทนหรือผู้แทนของผู้ใช้และมิได้ครอบครองและ/หรือเป็นเจ้าของสินค้าใดๆ ที่ลงรายการไว้บนไซต์",
    "8.3 หากคุณเป็นเจ้าของ IPR หรือตัวแทนที่ได้รับอนุญาตอย่างถูกต้องจากเจ้าของ IPR (“ ตัวแทน IPR ”) และคุณเชื่อว่าสิทธิของคุณหรือสิทธิตัวการของคุณได้ถูกละเมิด โปรดแจ้งให้เราทราบโดยการส่งแบบฟอร์มออนไลน์ที่ katrade.ku@gmail.com และส่งเอกสารให้ตามที่ระบุด้านล่างแก่เราเพื่อสนับสนุนการเรียกร้องสิทธิของคุณ โปรดให้เวลาเราประมวลข้อมูลที่ได้จัดส่งมาให้เราและ Katrade จะตอบข้อร้องเรียนของคุณโดยเร็วที่สุดเท่าที่สามารถดำเนินการได้",
    "8.4 ข้อเรียกร้องภายใต้ส่วนที่ 8 นี้ต้องจัดส่งให้ตามแบบฟอร์มที่กำหนดโดย Katrade ซึ่งอาจจะมีการปรับปรุงเป็นครั้งคราว และอย่างน้อยต้องดำเนินการดังต่อไปนี้ด้วย",
    "(ก) ลงลายมือชื่อจริงหรือลายเซ็นอิเล็กทรอนิกส์ของเจ้าของ IPR หรือ ตัวแทน IPR (เรียกรวมกันว่า “ผู้ให้ข้อมูล”)",
    "(ข) คำอธิบายถึงประเภทและลักษณะของสิทธิในทรัพย์สินทางปัญญาที่ถูกกล่าวหาว่าถูกละเมิดและหลักฐานแห่งสิทธิต่างๆ",
    "(ค)คำอธิบายลักษณะของการละเมิดที่ถูกกล่าวหาพร้อมรายละเอียดที่เพียงพอเพื่อให้ Katrade สามารถประเมินข้อร้องเรียนได้",
    "(ง) URL ของรายชื่อที่มีการกล่าวหาว่าละเมิด",
    "(จ) ข้อมูลเพียงพอที่จะช่วยให้ Katrade ติดต่อผู้ให้ข้อมูลได้ เช่น ที่อยู่ทางไปรษณีย์ หมายเลขโทรศัพท์ และที่อยู่อีเมล",
    "(ฉ) ถ้อยแถลงจากผู้ให้ข้อมูลที่ว่าข้อร้องเรียนนี้ได้ยื่นเข้ามาด้วยความเชื่อโดยสุจริตและการใช้ทรัพย์สินทางปัญญาที่ระบุโดยผู้ให้ข้อมูล ไม่ได้รับอนุญาตจากเจ้าของ IPR หรือตามที่กฎหมายบัญญัติให้ดำเนินการได้",
    "(ช) ถ้อยแถลงจากผู้ให้ข้อมูลที่ว่าข้อมูลในหนังสือบอกกล่าวนั้นถูกต้อง ทั้งนี้ผู้ให้ข้อมูลจะต้องรับผิดชดใช้ค่าเสียหายที่เราอาจได้รับอันเป็นผลมาจากข้อมูลที่ผู้ให้ข้อมูลได้จัดเตรียมมาให้ นอกจากนี้ ผู้ให้ข้อมูลรับรองว่าตนมีสิทธิอย่างเหมาะสมหรือได้รับอนุญาตให้ดำเนินการในนามของเจ้าของ IPR ในทุกกรณีที่เกี่ยวข้องกับการร้องเรียนดังกล่าว",
    "8.5 นอกจากกรณีที่มีการละเมิดสิทธิสิทธิในทรัพย์สินทางปัญญาตามที่ระบุข้างต้น Katrade ไม่มีหน้าที่ในการให้ความช่วยเหลือหรือดำเนินการใดๆ ในการบังคับใช้ข้อตกลงทางการค้าระหว่างผู้ผลิตและผู้ขาย",
    "8.6 ผู้ใช้แต่ละรายและทุกรายตกลงที่จะไม่ให้ Katrade และบริษัทในเครือ รับผิดชอบจากข้อเรียกร้องทั้งหมด จากการกระทำจากความเสียหายและการตัดสินในการนำเนื้อหาหรือรายการผลิตภัณฑ์ใด ๆ ออก อันเกิดจากการเรียกร้องเกี่ยวกับการละเมิดทรัพย์สินทางปัญญาใด ๆ",
    "9. การจัดส่ง",
    "9.1 การจัดส่งสิ่งของที่ใช้ในการแลกเปลี่ยนจะขึ้นอยู่กับข้อตกลงระหว่างผู้เทรดและคู่เทรดเท่านั้น Katrade จะไม่มีส่วนเกี่ยวข้องในการจัดส่งสินค้าใดๆทั้งสิ้น",
    "9.2 เมื่อเกิดความเสียหายใดๆต่อผู้เทรดหรือคู่เทรด ทาง Katrade จะไม่มีส่วนรับผิดชอบในความเสียหายทุกอย่างที่เกิดขึ้นจากการตกลงกันของผู้เทรดและคู่เทรด",
    "10. การยกเลิก การคืนสินค้าในการเทรด",
    "10.1 ขึ้นอยู่กับการตกลงของผู้เทรดและคู่เทรด โดยทาง Katrade จะไม่มีส่วนเกี่ยวข้องด้วยแต่อย่างใด",
    "10.2 โปรดอ่านข้อแนะนำในการเทรดเพื่อตัวของผู้ใช้เอง",
    "11. ความรับผิดชอบของผู้ใช้",
    "11.1 ควรจัดการและตรวจสอบอย่างเหมาะสมว่าข้อมูลที่เกี่ยวข้อง เช่น รายละเอียดสินค้า จำนวนสินค้า ข้อกำหนดหรือเงื่อนไข ในการแลกเปลี่ยนได้รับการอัปเดตในบัญชีรายชื่อสินค้าของผู้ใช้ และไม่โพสต์ข้อมูลที่ไม่ถูกต้องหรือทำให้เข้าใจผิด",
    "11.2 ผู้ใช้ทราบและตกลงว่าหากผู้ใช้ละเมิดนโยบายใดๆ ของ Katrade จะส่งผลให้มีการดำเนินการต่างๆ ดังที่ระบุไว้ในส่วนที่ 7.1",
    "12. ข้อพิพาท",
    "12.1 ในกรณีที่เกิดปัญหาในการทำแลกเปลี่ยน การยุติข้อพิพาทของปัญหานั้นจะเป็นไปตามนโยบายใดๆ ของ Katrade",
    "12.2 ผู้เทรดและคู่เทรดแต่ละฝ่ายให้คำรับรองและตกลงว่าตนจะไม่ฟ้องร้องหรือยื่นข้อร้องเรียนใดๆ ต่อ Katrade",
    "13. ความคิดเห็น",
    "13.1 Katrade ยินดีรับฟังทุกความคิดเห็นจากผู้ใช้ ซึ่งจะช่วยให้ Katrade ปรับปรุงคุณภาพของบริการที่มอบให้ โปรดดูรายละเอียดเพิ่มเติมเกี่ยวกับขั้นตอนการส่งความคิดเห็นด้านล่าง",
    "(ก) สามารถส่งความคิดเห็นเป็นลายลักษณ์อักษรทางอีเมลมายัง หรือใช้แบบฟอร์มความคิดเห็นในแอป",
    "(ข) ไม่รับความคิดเห็นที่ไม่ระบุชื่อผู้ร้องเรียน",
    "(ค) ผู้ใช้ที่ได้รับผลกระทบจากความคิดเห็นควรได้รับแจ้งถึงข้อเท็จจริงอย่างครบถ้วน และได้รับโอกาสให้ทำเรื่องชี้แจง",
    "(ง) ไม่รับความคิดเห็นที่คลุมเครือและทำให้เสื่อมเสีย",
    "14. การปฏิเสธความรับผิดชอบ",
    "14.1 บริการนี้จัดไว้ให้ “ตามสภาพจริง” โดยไม่มีการรับประกัน การอ้างสิทธิ์ หรือการรับรองโดย Katrade ไม่ว่าในลักษณะใด ทั้งแบบชัดแจ้ง โดยนัย หรือแบบบังคับ อันเกี่ยวเนื่องกับบริการ รวมถึงแต่ไม่จำกัดเพียง การรับประกันคุณภาพ การดำเนินงาน การไม่ละเมิดสิทธิ ความสามารถในการทำการค้า หรือความเหมาะสมสำหรับวัตถุประสงค์เฉพาะ รวมทั้งไม่มีการรับประกันที่เกิดขึ้นระหว่างการติดต่อ การดำเนินงาน หรือการใช้เพื่อการค้า โดยไม่เป็นการจำกัดสิ่งที่กล่าวไปก่อนหน้านี้ และจนถึงขอบเขตสูงสุดที่กฎหมายที่เกี่ยวข้องอนุญาตไว้ Katrade ไม่รับประกันว่า บริการ ไซต์นี้ หรือการทำงานในไซต์จะพร้อมใช้งานได้ เข้าถึงได้ ไม่หยุดชะงัก ทันต่อเวลา ปลอดภัย ถูกต้อง ครบถ้วน หรือปราศจากข้อผิดพลาด ว่าข้อบกพร่อง หากมี จะได้รับการแก้ไข หรือว่า ไซต์นี้และ/หรือเซิร์ฟเวอร์ของไซต์จะใช้งานได้โดยปราศจากไวรัส นาฬิกา ระบบตั้งเวลา ตัวนับ หนอน ล็อคซอฟต์แวร์ อุปกรณ์สอดแนม ม้าโทรจัน เราติ้ง ประตูกับดัก ระเบิดเวลา หรือรหัส คำสั่ง โปรแกรม หรือส่วนประกอบที่เป็นอันตรายอื่นใด",
    "14.2 คุณรับทราบว่าความเสี่ยงทั้งหมดที่เกิดขึ้นจากการใช้หรือการดำเนินงานของไซต์นี้และ/หรือบริการ ตกเป็นของคุณจนถึงขอบเขตสูงสุดที่กฎหมายที่เกี่ยวข้องอนุญาตไว้",
    "14.3 Katrade ไม่ได้ควบคุมและ จนถึงขอบเขตสูงสุดที่กฎหมายที่เกี่ยวข้องอนุญาตไว้ ไม่รับประกันหรือรับผิดชอบต่อ :",
    "(ก) ความเหมาะสมเพื่อวัตถุประสงค์ การมีอยู่ คุณภาพ ความปลอดภัยหรือความชอบด้วยกฎหมายของสินค้าที่วางจำหน่ายผ่านทางบริการ",
    "(ข) ความสามารถของผู้ขายในการขายสินค้าหรือของผู้ซื้อในการชำระค่าสินค้า หากมีข้อพิพาทที่เกี่ยวกับผู้ใช้ตั้งแต่หนึ่งคนขึ้นไป ผู้ใช้ดังกล่าวตกลงที่จะยุติข้อพิพาทระหว่างกันโดยตรง และจนถึงขอบเขตสูงสุดที่กฎหมายที่เกี่ยวข้องอนุญาตไว้ ปลดปล่อย Katrade และบริษัทในเครือออกจากการอ้างสิทธิ การเรียกร้อง และความเสียหายใดๆ และทั้งหมด อันเกิดจากหรือเกี่ยวเนื่องกับข้อพิพาทดังกล่าว",
    "15. ลิงก์ไปยังไซต์ของบุคคลภายนอก",
    "ลิงก์ของบุคคลภายนอกซึ่งมีอยู่ทั่วทั้งไซต์ จะให้คุณสามารถออกจากไซต์นี้ได้ ลิงก์เหล่านี้จัดไว้ให้ตามมารยาทเท่านั้น และไซต์ที่มีลิงก์ไปไม่ได้อยู่ภายใต้การควบคุมของ Katrade ไม่ว่าในลักษณะใด และคุณเข้าถึงไซต์เหล่านี้ด้วยความเสี่ยงของคุณเอง Katrade ไม่รับผิดชอบไม่ว่ากรณีใดต่อเนื้อหาของไซต์ที่ลิงก์ไปดังกล่าว หรือลิงก์ที่อยู่ในไซต์ที่มีลิงก์ไป รวมถึงการเปลี่ยนแปลงหรือการอัปเดตไซต์ดังกล่าว Katrade จัดลิงก์เหล่านี้ไว้ให้เพื่อความสะดวกเท่านั้น และการรวมลิงก์ใดๆ ไว้ไม่ได้แสดงนัยหรือการเชื่อมโยงอย่างชัดแจ้ง การรับรอง หรือการเป็นผู้สนับสนุนโดย Katrade ถึงไซต์ที่ลิงก์ไปใดๆ และ/หรือเนื้อหาในไซต์ที่ลิงก์ไปนั้น",
    "16. การรับรองและการรับประกันของคุณ",
    "คุณรับรองและรับประกันว่า :",
    "(ก) คุณบรรลุนิติภาวะ (และในกรณีของผู้เยาว์ ได้รับความยินยอมจากพ่อแม่หรือผู้ปกครองตามกฎหมาย) มีสิทธิและความสามารถที่จะเข้าทำสัญญาเงื่อนไขการให้บริการนี้และปฏิบัติตามเงื่อนไขนี้ และ",
    "(ข) คุณจะใช้บริการเพื่อจุดประสงค์ที่ถูกกฎหมายและตามเงื่อนไขการให้บริการนี้ และกฎหมาย กฎระเบียบ ประมวลกฎหมาย คำสั่ง แนวทางปฏิบัติ นโยบายและข้อบังคับที่บังคับใช้ทั้งหมด",
    "17. บทบัญญัติทั่วไป",
    "17.1 Katrade สงวนสิทธิ์ทั้งหมดที่ไม่ได้ให้ไว้โดยชัดแจ้งในที่นี้",
    "17.2 Katrade อาจแก้ไขเงื่อนไขการให้บริการนี้ได้ตลอดเวลาโดยโพสต์เงื่อนไขการให้บริการฉบับแก้ไขบนไซต์นี้ การใช้งานไซต์นี้ต่อไปของคุณหลังการเปลี่ยนแปลงดังกล่าวจะถือว่าคุณยอมรับเงื่อนไขการให้บริการฉบับแก้ไขนั้นแล้ว",
    "17.3 คุณต้องไม่มอบหมาย ให้สิทธิ์การใช้งานต่อ หรือโอนสิทธิที่มอบให้แก่คุณในที่นี้หรือทำสัญญาช่วงข้อผูกพันใดๆ ของคุณ",
    "17.4 ไม่มีสิ่งใดอนุญาตให้คุณสร้างภาระค่าใช้จ่ายหรือหนี้สินในนามของ Katrade",
    "17.5 ความล้มเหลวของ Katrade ไม่ว่าเวลาใด ที่จะบังคับใช้บทบัญญัติใดของเงื่อนไขนี้ ไม่ส่งผลไม่ว่าในทางใดต่อสิทธิของตนในภายหลังที่จะบังคับใช้บทบัญญัติดังกล่าว เว้นแต่มีการสละสิทธิ์ไว้เป็นลายลักษณ์อักษร",
    "17.6 เงื่อนไขการให้บริการนี้มีไว้เพื่อคุณและประโยชน์ของเราเท่านั้น และไม่ใช่เพื่อประโยชน์ของบุคคลหรือนิติบุคคลอื่นใด",
    "17.7 คุณตกลงที่จะปฏิบัติตามกฎหมาย บทกฎหมาย ข้อบังคับและประมวลกฎหมายที่บังคับใช้ทั้งหมด ที่เกี่ยวกับการต่อต้านการติดสินบนและการทุจริต รวมถึงแต่ไม่จำกัดเพียงพระราชบัญญัติการติดสินบนของสหราชอาณาจักร กฎหมายป้องกันการทุจริตในต่างประเทศของสหรัฐฯ และกฎหมายป้องกันการทุจริตของสิงคโปร์ รวมทั้งยืนยันว่าคุณได้และจะกำหนดนโยบายและระเบียบทั้งหมดที่จำเป็นเพื่อรับรองการปฏิบัติตามข้อกำหนดดังที่ว่านี้",
    "17.8 หากมีคำถามหรือข้อกังวลเกี่ยวกับเงื่อนไขการให้บริการนี้ หรือมีปัญหาที่เกิดจากเงื่อนไขการให้บริการนี้หรือบนไซต์ โปรดติดต่อเราที่ : katrade.ku@gmail.com "]
const en = ["Terms of Service","อยู่ระหว่างการแปล . . ."]


export default function TermsOfService() {

    const { lang } = useContext(LanguageContext);
    const [ content, setContent ] = useState<string[]>(lang === "en" ? en : th)

    useEffect(() => {
        setContent(lang === "en" ? en : th)
    }, [ lang ])

    // var topButton = document.getElementById("topbtn")
    // window.onscroll = function() {scrollFunc()};

    // function scrollFunc() {
    //     if (document.body.scrollTop > 20 || document.documentElement.scrollTop > 20) {
    //         topButton.style.display = "block";
    //     } 
    //     else {
    //         topButton.style.display = "none";
    //     }
    // }

    // function goToTopFunc() {
    //     document.body.scrollTop = 0;
    //     document.documentElement.scrollTop = 0;

    // }

    return (
        <>
            <Background>
                <StaticNav />
                <BackToTop showBelow={250} />
                <div className="row justify-content-center m-0 py-3 full-width">
                    <div className="center-content-screen col-8 mb-5 px-5">
                        <div className="text-center mb-5">
                            <H4>{content[0]}</H4>
                        </div>
                        <div className="text-left mb-4">
                            <P className="mb-3"><b>{content[1]}</b></P>
                            <P>{content[2]}</P>
                            <P>{content[3]}</P>
                            <P>{content[4]}</P>
                            <P>{content[5]}</P>
                            <P>{content[6]}</P>
                        </div>
                        <div className="text-left mb-4">
                            <P className="mb-3"><b>{content[7]}</b></P>
                            <P className="mb-3">{content[8]}</P>
                            <P className="mb-3">{content[9]}</P>
                            <P className="mb-3">{content[10]}</P>
                            <P className="mb-3">{content[11]}</P>
                            <P className="mb-3">{content[12]}</P>
                            <P className="mb-3">{content[13]}</P>
                            <P className="mb-3">{content[14]}</P>
                        </div>
                        <div className="text-left mb-4">
                            <P className="mb-3"><b>{content[15]}</b></P>
                            <P className="mb-3">{content[16]}</P>
                            <P>{content[17]}</P>
                            <P>{content[18]}</P>
                            <P className="mb-3">{content[19]}</P>
                            <P className="mb-3">{content[20]}</P>
                            <P>{content[21]}</P>
                            <P>{content[22]}</P>
                            <P className="mb-3">{content[23]}</P>
                        </div>
                        <div className="text-left mb-4">
                            <P className="mb-3"><b>{content[24]}</b></P>
                            <P className="mb-3">{content[25]}</P>
                            <P className="mb-3">{content[26]}</P>
                        </div>
                        <div className="text-left mb-4">
                            <P className="mb-3"><b>{content[27]}</b></P>
                            <P className="mb-3">{content[28]}</P>
                        </div>
                        <div className="text-left mb-4">
                            <P className="mb-3"><b>{content[29]}</b></P>
                            <P className="mb-3">{content[30]}</P>
                            <P className="mb-3">{content[31]}</P>
                            <P>{content[32]}</P>
                            <P>{content[33]}</P>
                            <P>{content[34]}</P>
                            <P className="mb-3">{content[35]}</P>
                            <P className="mb-3">{content[36]}</P>
                            <P>{content[37]}</P>
                            <P>{content[38]}</P>
                            <P>{content[39]}</P>
                            <P>{content[40]}</P>
                            <P>{content[41]}</P>
                            <P>{content[42]}</P>
                            <P className="mb-3">{content[43]}</P>
                            <P className="mb-3">{content[44]}</P>
                            <P className="mb-3">{content[45]}</P>
                        </div>
                        <div className="text-left mb-4">
                            <P className="mb-3"><b>{content[46]}</b></P>
                            <P className="mb-3">{content[47]}</P>
                            <P className="mb-3">{content[48]}</P>
                            <P>{content[49]}</P>
                            <P>{content[50]}</P>
                            <P>{content[51]}</P>
                            <P>{content[52]}</P>
                            <P>{content[53]}</P>
                            <P>{content[54]}</P>
                            <P>{content[55]}</P>
                            <P>{content[56]}</P>
                            <P>{content[57]}</P>
                            <P>{content[58]}</P>
                            <P>{content[59]}</P>
                            <P>{content[60]}</P>
                            <P>{content[61]}</P>
                            <P>{content[62]}</P>
                            <P>{content[63]}</P>
                            <P>{content[64]}</P>
                            <P>{content[65]}</P>
                            <P>{content[66]}</P>
                            <P>{content[67]}</P>
                            <P>{content[68]}</P>
                            <P>{content[69]}</P>
                            <P>{content[70]}</P>
                            <P>{content[71]}</P>
                            <P>{content[72]}</P>
                            <P>{content[73]}</P>
                            <P className="mb-3">{content[74]}</P>
                            <P className="mb-3">{content[75]}</P>
                            <P className="mb-3">{content[76]}</P>
                            <P>{content[77]}</P>
                            <P>{content[78]}</P>
                            <P>{content[79]}</P>
                            <P className="mb-3">{content[80]}</P>
                            <P className="mb-3">{content[81]}</P>
                            <P>{content[82]}</P>
                            <P>{content[83]}</P>
                            <P>{content[84]}</P>
                            <P>{content[85]}</P>
                            <P className="mb-3">{content[86]}</P>
                        </div>
                        <div className="text-left mb-4">
                            <P className="mb-3"><b>{content[87]}</b></P>
                            <P className="mb-3">{content[88]}</P>
                            <P>{content[89]}</P>
                            <P>{content[90]}</P>
                            <P>{content[91]}</P>
                            <P>{content[92]}</P>
                            <P className="mb-3">{content[93]}</P>
                            <P className="mb-3">{content[94]}</P>
                        </div>
                        <div className="text-left mb-4">
                            <P className="mb-3"><b>{content[95]}</b></P>
                            <P className="mb-3">{content[96]}</P>
                            <P className="mb-3">{content[97]}</P>
                            <P className="mb-3">{content[98]}</P>
                            <P className="mb-3">{content[99]}</P>
                            <P>{content[100]}</P>
                            <P>{content[101]}</P>
                            <P>{content[102]}</P>
                            <P>{content[103]}</P>
                            <P>{content[104]}</P>
                            <P>{content[105]}</P>
                            <P className="mb-3">{content[106]}</P>
                            <P className="mb-3">{content[107]}</P>
                            <P className="mb-3">{content[108]}</P>
                        </div>
                        <div className="text-left mb-4">
                            <P className="mb-3"><b>{content[109]}</b></P>
                            <P className="mb-3">{content[110]}</P>
                            <P className="mb-3">{content[111]}</P>
                        </div>
                        <div className="text-left mb-4">
                            <P className="mb-3"><b>{content[112]}</b></P>
                            <P className="mb-3">{content[113]}</P>
                            <P className="mb-3">{content[114]}</P>
                        </div>
                        <div className="text-left mb-4">
                            <P className="mb-3"><b>{content[115]}</b></P>
                            <P className="mb-3">{content[116]}</P>
                            <P className="mb-3">{content[117]}</P>
                        </div>
                        <div className="text-left mb-4">
                            <P className="mb-3"><b>{content[118]}</b></P>
                            <P className="mb-3">{content[119]}</P>
                            <P className="mb-3">{content[120]}</P>
                        </div>
                        <div className="text-left mb-4">
                            <P className="mb-3"><b>{content[121]}</b></P>
                            <P className="mb-3">{content[122]}</P>
                            <P>{content[123]}</P>
                            <P>{content[124]}</P>
                            <P>{content[125]}</P>
                            <P className="mb-3">{content[126]}</P>
                        </div>
                        <div className="text-left mb-4">
                            <P className="mb-3"><b>{content[127]}</b></P>
                            <P className="mb-3">{content[128]}</P>
                            <P className="mb-3">{content[129]}</P>
                            <P className="mb-3">{content[130]}</P>
                            <P>{content[131]}</P>
                            <P className="mb-3">{content[132]}</P>
                        </div>
                        <div className="text-left mb-4">
                            <P className="mb-3"><b>{content[133]}</b></P>
                            <P className="mb-3">{content[134]}</P>
                        </div>
                        <div className="text-left mb-4">
                            <P className="mb-3"><b>{content[135]}</b></P>
                            <P className="mb-3">{content[136]}</P>
                            <P>{content[137]}</P>
                            <P className="mb-3">{content[138]}</P>
                        </div>
                        <div className="text-left mb-4">
                            <P className="mb-3"><b>{content[139]}</b></P>
                            <P className="mb-3">{content[140]}</P>
                            <P className="mb-3">{content[141]}</P>
                            <P className="mb-3">{content[142]}</P>
                            <P className="mb-3">{content[143]}</P>
                            <P className="mb-3">{content[144]}</P>
                            <P className="mb-3">{content[145]}</P>
                            <P className="mb-3">{content[146]}</P>
                            <P className="mb-3">{content[147]}</P>
                        </div>
                    </div>
                </div>
            </Background>
        </>
    )
}